trade_exp/src/Documents/НехваткаТовара/НехваткаТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="c8311102-2bb4-436b-bb12-66a8da975638">
  <name>НехваткаТовара</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="a6a14f4b-e501-4d3c-b989-b47e39a06b3f">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b3348314-21e1-40ff-be74-2f524dcfabb1">
    <name>Менеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1880af22-1fb4-494f-82e9-1c5c55396c16">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3136c8ee-21fb-4db2-aa89-8fa81fbbc89c">
    <name>Клиент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c93b9b15-5986-4cd3-a754-807c83cdbe32">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="2a14ac7a-5fb6-49a8-a040-bf2f5c3ba3b1">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="052f89b3-e0c0-4be4-b42b-c2c96f9bab55">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e3b559db-d993-4540-ba27-0b752c9cde67">
      <name>БылоНужно</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="14e07e05-addc-41ea-a48d-45abc58c45f4">
      <name>Остаток</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="bdeb5405-6cf8-4efb-b529-169c232cf7d0">
      <name>Нехватка</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="ec59bc91-ae13-458b-93ed-ffb0dc5f1e1f">
      <name>КлассТовара</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="7344d98b-2a78-4b12-a240-f54c32ce62f7">
      <name>Ликвидность</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="4bd83840-ee98-485c-ae3a-4a20564e386d">
      <name>ОповещенПоEmail</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/InformationRegisters/ВариантыОбеспеченияТоварами/ВариантыОбеспеченияТоварами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="7da1b5e1-331e-4dd0-befe-6664dd86bf92">
  <name>ВариантыОбеспеченияТоварами</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <attributes extendedConfigurationObject="03ede1e8-d277-49f1-926b-78a209555ecc">
    <name>РеквизитДопУпорядочивания</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <dimensions extendedConfigurationObject="7966bf8b-8dea-418d-8153-75858f8d495b">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="4bf6a614-5a3a-48cc-90b9-3fd965f34119">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="ea23be2e-cdd4-4995-97a6-35c922d01fb1">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="de53f388-f0a3-4995-b44a-085f5e521468">
    <name>СпособОбеспеченияПотребностей</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Documents/НехваткаТовара/ObjectModule.bsl
&Перед("ПередЗаписью")
Процедура Док_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	////////// Задача https://bitrix.tg-alterra.ru/company/personal/user/1794/tasks/task/view/149411/
	Если Не Склад.ТорговыйЗал Тогда
		Для каждого Товар из Товары Цикл
			НаборЗаписей = РегистрыСведений.ВариантыОбеспеченияТоварами.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Склад.Установить(Склад);
			НаборЗаписей.Отбор.Номенклатура.Установить(Товар.Номенклатура);
			Если БонусыАльтерраРезерв.ПолучитьЗначениеРеквизита(Товар, "Характеристика") <> Ложь Тогда
				НаборЗаписей.Отбор.Характеристика.Установить(Товар.Характеристика);
			КонецЕсли;
			НаборЗаписей.Прочитать();
			
			Если НаборЗаписей.Количество() > 0 
				И Строка(НаборЗаписей[0].СпособОбеспеченияПотребностей) = "Ассортимент ТЗ" Тогда
				Сообщить("Номенклатура " + Товар.Номенклатура + " не является ассортиментом " + Склад + ". Добавить в нехватку не возможно.");
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	//////////
КонецПроцедуры
